ir_version: 3
producer_name: "Chainer"
producer_version: "5.0.0b1"
graph {
  name: "Graph"
  input {
    name: "140435138761336"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "140435138761056"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138677336"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "140436179240832"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138777608"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "140435138777328"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138764696"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "140435138764416"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138761896"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "140435138761616"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138762456"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "140435138762176"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138764136"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "140435138763856"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138763016"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "140435138762736"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138779288"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "140435138779008"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "140435138779848"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
  input {
    name: "140435138779568"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "140435138778728"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "140435138778448"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
          dim {
            dim_value: 25088
          }
        }
      }
    }
  }
  input {
    name: "140435138714536"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "140435138714144"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138715096"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "140435138714816"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138763576"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "140435138763296"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138778168"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "140435138777888"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "140435138760776"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "140435138715376"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "140435138860480"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}

